templates/openfoam_mrf_case/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// Template — geometry entries and refinement levels are filled by
// dict_writer.write_snappy_hex_mesh_dict() based on the loaded STL files.

castellatedMesh true;
snap            true;
addLayers       true;

geometry
{
    // STL entries injected by case builder, e.g.:
    // rotor_1.stl { type triSurfaceMesh; name rotor_1; }
    // hub.stl     { type triSurfaceMesh; name hub; }
}

castellatedMeshControls
{
    maxLocalCells       1000000;
    maxGlobalCells      5000000;
    minRefinementCells  10;
    maxLoadUnbalance    0.10;
    nCellsBetweenLevels 2;

    features
    (
        // Feature edge files injected by case builder
    );

    refinementSurfaces
    {
        // Surface refinement entries injected by case builder
    }

    resolveFeatureAngle 30;

    refinementRegions
    {
    }

    locationInMesh ({{INSIDE_POINT_X}} {{INSIDE_POINT_Y}} {{INSIDE_POINT_Z}});

    allowFreeStandingZoneFaces true;
}

snapControls
{
    nSmoothPatch        3;
    tolerance           2.0;
    nSolveIter          30;
    nRelaxIter          5;
    nFeatureSnapIter    10;
    implicitFeatureSnap false;
    explicitFeatureSnap true;
    multiRegionFeatureSnap false;
}

addLayersControls
{
    relativeSizes       true;
    layers
    {
        "(hub|duct|rotor|stator).*"
        {
            nSurfaceLayers {{N_BOUNDARY_LAYERS}};
        }
    }
    expansionRatio          {{LAYER_EXPANSION_RATIO}};
    finalLayerThickness     0.3;
    minThickness            0.1;
    nGrow                   0;
    featureAngle            60;
    slipFeatureAngle        30;
    nRelaxIter              3;
    nSmoothSurfaceNormals   1;
    nSmoothNormals          3;
    nSmoothThickness        10;
    maxFaceThicknessRatio   0.5;
    maxThicknessToMedialRatio 0.3;
    minMedialAxisAngle      90;
    nBufferCellsNoExtrude   0;
    nLayerIter              50;
}

meshQualityControls
{
    maxNonOrtho         65;
    maxBoundarySkewness 20;
    maxInternalSkewness 4;
    maxConcave          80;
    minVol              1e-13;
    minTetQuality       1e-15;
    minArea             -1;
    minTwist            0.02;
    minDeterminant      0.001;
    minFaceWeight       0.05;
    minVolRatio         0.01;
    minTriangleTwist    -1;
    nSmoothScale        4;
    errorReduction      0.75;
}

writeFlags
(
    scalarLevels
    surfaceSets
    pointSets
    cellSets
);

mergeTolerance 1e-6;

// ************************************************************************* //
