templates/openfoam_mrf_case/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// Air at 20°C, 1 atm
// nu = mu / rho = 1.81e-5 / 1.225 ≈ 1.48e-5 m²/s

transportModel  Newtonian;

nu              nu [ 0 2 -1 0 0 0 0 ] {{NU}};

// ************************************************************************* //
